Documents/ЧекККМВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЧекККМВозврат</Name>
			<BasedOn>
				<xr:Item>Document.ЧекККМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассахККМ</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОрдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПлатежаСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВКассу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекККМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОплатаПлатежнымиКартами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенияДатЗапрета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПлатежиПоРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлатежиПоРеструктуризацииДолга</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекНеПробит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДоговорыЭквайринга</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыПлатежныхКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЧекККМВозврат/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета Тогда
		
		Если РасшифровкаПлатежаСписком Тогда
			Элементы.РасчетыПоЛицевымСчетам.Видимость = Истина;
		Иначе
			Элементы.РасчетыПоЛицевымСчетам.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Процедура - обработчик события ПриИзменении поля ЭквайринговыйТерминал на сервере.
//
&НаСервере
Процедура ЭквайринговыйТерминалПриИзмененииНаСервере()
	
	ПолучитьСсылкиНаОборудование();
	ПолучитьСписокВыбораВидовПлатежныхКарт();
	
КонецПроцедуры // ЭквайринговыйТерминалПриИзмененииНаСервере()

// Процедура - обработчик события ПриИзменении поля ЭквайринговыйТерминал.
//
&НаКлиенте
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	
	ЭквайринговыйТерминалПриИзмененииНаСервере();
	
КонецПроцедуры // ЭквайринговыйТерминалПриИзменении()

// Функция помещает табличную часть РасшифровкаРасчетов во временное хранилище
// и возвращает адрес.
//
&НаСервере
Функция ПоместитьРасшифровкаПлатежаВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.РасшифровкаПлатежа.Выгрузить(),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()

// Функция получает табличную часть РасшифровкаРасчетов из временного хранилища.
//
&НаСервере
Процедура ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище)
	
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Объект.РасшифровкаПлатежа.Очистить();
	Для каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаРасшифровкаПлатежа);
	КонецЦикла;
	
	Если Объект.СуммаДокумента = 0 Тогда
	
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");	
	
	КонецЕсли; 
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

// Процедура заполняет расшифровку платежа.
//
&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа(ТекущийОбъект = Неопределено)
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.Здания)
	|	И ДатыЗапретаИзменения.Объект = &Здание";
	
	Запрос.УстановитьПараметр("Здание", ТекущийОбъект.ЛицевойСчет.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Период = Выборка.ДатаЗапрета;
	Иначе
		Период = ТекущийОбъект.Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК Сумма,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	|		РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|		ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстатки.Организация КАК Организация,
	|		ЛОЖЬ КАК ПризнакАванса
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления < &Период
	|					И МесяцНачисления > &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетам.Услуга,
	|		РасчетыПоЛицевымСчетам.МесяцНачисления,
	|		РасчетыПоЛицевымСчетам.Сумма,
	|		РасчетыПоЛицевымСчетам.Организация,
	|		ЛОЖЬ
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	|	ГДЕ
	|		РасчетыПоЛицевымСчетам.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления < &Период
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления > &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления = &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстаткиАвансы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамАвансы.Сумма,
	|		РасчетыПоЛицевымСчетамАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетамАвансы
	|	ГДЕ
	|		РасчетыПоЛицевымСчетамАвансы.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетамАвансы.МесяцНачисления = &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга,
	|		&ПустаяДата,
	|		ПланированиеАвансовЛицевыеСчета.СуммаНачислено,
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	|	ГДЕ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация = &Организация
	|		И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата >= &ДатаНач
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата <= &ДатаКон
	|		И НЕ ПланированиеАвансовЛицевыеСчета.Ссылка.ПометкаУдаления) КАК РасчетыПоЛицевымСчетамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ВидУслуги.ПолеСортировки,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ПолеСортировки";
	
	Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийОбъект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущийОбъект.Дата));
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	ТекущийОбъект.РасшифровкаПлатежа.Очистить();
	
	СуммаОсталосьРаспределить = ТекущийОбъект.СуммаДокумента;
	
	//ЗапросПоРеструктуризации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ПлатежиПоРеструктуризацииДолга.СуммаПлатежа, 0) КАК Сумма,
	|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаРасход, 0) КАК ОплченоВЭтомМесяце
	|ИЗ
	|	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&ДатаНач, &ДатаКон, , Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК РасчетыПоЛицевымСчетамОбороты
	|		ПО ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет
	|ГДЕ
	|	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = &ЛицевойСчет
	|	И ПлатежиПоРеструктуризацииДолга.Период = КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)";
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийОбъект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущийОбъект.Дата));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.ОплченоВЭтомМесяце <> 0 Тогда
			Сумма = Выборка.Сумма - Выборка.ОплченоВЭтомМесяце;
			Если Сумма < 0 Тогда
				Сумма = 0;
			КонецЕсли;
		Иначе	 
			Сумма = Выборка.Сумма;
		КонецЕсли;
		
	Иначе 
		Сумма = 0;
	КонецЕсли;
	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		НоваяСтрока = ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			Если ВыборкаРезультатаЗапроса.Услуга = Справочники.Услуги.РеструктуризацияДолга  Тогда  //Сначала оплатим по реструктуризации
				Если Сумма <> 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
					
					Если Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
						
						НоваяСтрока.Сумма = Сумма;
						СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - Сумма;
						
					Иначе // сумма остатка больше чем нужно распределить
						
						НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
						СуммаОсталосьРаспределить = 0;
						
					КонецЕсли;
				Иначе 
					ТекущийОбъект.РасшифровкаПлатежа.Удалить(НоваяСтрока.НомерСтроки-1);	
				КонецЕсли;
			Иначе
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				
				Если ВыборкаРезультатаЗапроса.Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
					
					НоваяСтрока.Сумма = ВыборкаРезультатаЗапроса.Сумма;
					СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.Сумма;
					
				Иначе // сумма остатка больше чем нужно распределить
					
					НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
					СуммаОсталосьРаспределить = 0;
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.Сумма = СуммаОсталосьРаспределить;
			НоваяСтрока.ПризнакАванса = Истина;
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущийОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		ТекущийОбъект.РасшифровкаПлатежа[0].Сумма = Объект.СуммаДокумента;
		ТекущийОбъект.РасшифровкаПлатежа[0].ПризнакАванса = Истина;
		
	КонецЕсли;
	

	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

// Процедура - обработчик команды "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Режим = РежимДиалогаВопрос.ОК;
		Вопрос(НСтр("ru='Укажите вначале лицевой счет!';uk='Укажіть спочатку особовий рахунок!'"), Режим, 0);
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресРасшифровкаПлатежаВХранилище,
		|Организация,
		|Дата,
		|ЛицевойСчет,
		|Ссылка,
		|ВалютаДенежныхСредств,
		|СуммаДокумента",
		АдресРасшифровкаПлатежаВХранилище,
		Объект.Организация,
		Объект.Дата,
		Объект.ЛицевойСчет,
		Объект.Ссылка,
		ВалютаДенежныхСредств,
		Объект.СуммаДокумента
	);
		
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораДолговПоЛицевымСчетам", ПараметрыПодбора);
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "ЗаполнитьРасшифровкку".
//
&НаКлиенте
Процедура ЗаполнитьРасшифровку(Команда)
	
	Если Объект.СуммаДокумента = 0 Тогда
		Предупреждение(НСтр("ru='Укажите вначале сумму документа.';uk='Укажіть спочатку суму документа.'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
	
		Ответ = Вопрос(
			НСтр("ru='Расшифровка будет полностью перезаполнена. Продолжить?';uk='Розшифрування буде повністю перезаповнене. Продовжити?'"),
			РежимДиалогаВопрос.ДаНет
		);
			
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета") Тогда
		
		ЗаполнитьРасшифровкуПлатежа();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "РасшифровкаПлатежаСписком".
//
&НаКлиенте
Процедура РасшифровкаПлатежаСпискомПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);

	Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит Тогда
		УстановитьРежимТолькоПросмотр();
	КонецЕсли;
	
	РасшифровкаПлатежаСписком = Объект.РасшифровкаПлатежаСписком;
	УстановитьВидимостьИДоступность();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта = Константы.ВалютаУчета.Получить();
		ПолучитьСписокВыбораВидовПлатежныхКарт();
	КонецЕсли;
	
	ВалютаДенежныхСредств = Объект.Валюта;
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	КонецЕсли;
	
	СтатусЧекПробит = Перечисления.СтатусыЧековККМ.Пробит;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
		
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьСписокВыбораВидовПлатежныхКарт();
	
	Элементы.ПробитьЧек.Доступность = НЕ Объект.ПометкаУдаления;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

// Процедура устанавливает режим Только просмотр.
//
Процедура УстановитьРежимТолькоПросмотр()
	
	ТолькоПросмотр = Истина; // Чек пробит. Изменение информации запрещено.
	Элементы.ПробитьЧек.Доступность = Ложь;
	
КонецПроцедуры // УстановитьРежимТолькоПросмотр()

&НаКлиенте
Процедура РасшифровкаПлатежаПризнакАвансаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные.ПризнакАванса Тогда
		ТекущиеДанные.МесяцНачисления = '00010101';	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаМесяцНачисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.МесяцНачисления) Тогда
		ТекущиеДанные.ПризнакАванса = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

// Получает ссылки на внешнее оборудование.
//
&НаСервере
Процедура ПолучитьСсылкиНаОборудование()

	ФискальныйРегистратор = ?(ИспользоватьПодключаемоеОборудование // Проверка на включенную ФО "Использовать ВО"
						  И ЗначениеЗаполнено(Объект.КассаККМ)
						  И ЗначениеЗаполнено(Объект.КассаККМ.ПодключаемоеОборудование),
						  Объект.КассаККМ.ПодключаемоеОборудование.Ссылка,
						  Справочники.ПодключаемоеОборудование.ПустаяСсылка());

	ЭквайринговыйТерминал = ?(ИспользоватьПодключаемоеОборудование
						  И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал)
						  И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал.ПодключаемоеОборудование)
					  	  И НЕ Объект.ЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования,
						  Объект.ЭквайринговыйТерминал.ПодключаемоеОборудование,
						  Справочники.ПодключаемоеОборудование.ПустаяСсылка());

КонецПроцедуры // ПолучитьСсылкиНаОборудование()

// Процедура заполнения списка видов платежных карт.
//
&НаСервере
Процедура ПолучитьСписокВыбораВидовПлатежныхКарт()
	
	МассивВидовПлатежныхКарт = Справочники.ЭквайринговыеТерминалы.ВидыПлатежныхКарт(Объект.ЭквайринговыйТерминал);
	
	Элементы.ОплатаПлатежнымиКартамиВидПлатежнойКарты.СписокВыбора.ЗагрузитьЗначения(МассивВидовПлатежныхКарт);
	
КонецПроцедуры // ПолучитьСписокВыбораВидовПлатежныхКарт()

// Процедура печати чека на фискальном регистраторе.
//
&НаКлиенте
Процедура ПробитьЧек()
	
	ОписаниеОшибки = "";
	
	Если Объект.НомерЧекаККМ <> 0 Тогда
		
		ТекстСообщения = НСтр("ru='Чек уже пробит на фискальном регистраторе!';uk='Чек вже пробитий на фіскальному реєстраторі!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьВозможностьПечатиЧека(ЭтаФорма) Тогда
		
		Если ИспользоватьПодключаемоеОборудование // Проверка на включенную ФО "Использовать ВО"
		   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента()Тогда // Проверка на определенность рабочего места ВО
			ИдентификаторУстройства = ?(ЗначениеЗаполнено(ФискальныйРегистратор),
										ФискальныйРегистратор,
										Неопределено);
				
			Если ИдентификаторУстройства <> Неопределено Тогда
				// Подключаем ФР
				Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
																							  ИдентификаторУстройства,
																							  ОписаниеОшибки);
					
				Если Результат Тогда
					
					// Готовим данные
					ВходныеПараметры  = Новый Массив;
					ВыходныеПараметры = Неопределено;
					
					НомерСекции = 1;
					
					// Подготовка таблицы товаров
					ТаблицаТоваров = Новый Массив();
					
					Для каждого СтрокаТЧ Из Объект.РасшифровкаПлатежа Цикл
						
						СтавкаНДС = 0;
						НомерНалога = 0;
						СуммаСкидки = 0;
						СуммаНДС = 0; 
						
						СтрокаТаблицыТоваров = Новый СписокЗначений();
						Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
							СтрокаТаблицыТоваров.Добавить(Строка(СтрокаТЧ.Услуга));
						Иначе
							СтрокаТаблицыТоваров.Добавить("Аванс");
						КонецЕсли;
																					//  1 - Наименование
						СтрокаТаблицыТоваров.Добавить("");                          //  2 - Штрихкод
						СтрокаТаблицыТоваров.Добавить("");                          //  3 - Артикул
						СтрокаТаблицыТоваров.Добавить(НомерСекции);                 //  4 - Номер отдела
						СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.Сумма);              //  5 - Цена за позицию без скидки
						СтрокаТаблицыТоваров.Добавить(1); 					        //  6 - Количество
						СтрокаТаблицыТоваров.Добавить("");                          //  7 - Наименование скидки/наценки
						СтрокаТаблицыТоваров.Добавить(СуммаСкидки);                 //  8 - Сумма скидки/наценки
						СтрокаТаблицыТоваров.Добавить(0);						    //  9 - Процент скидки/наценки
						СтрокаТаблицыТоваров.Добавить(СтрокаТЧ.Сумма);              // 10 - Сумма позиции со скидкой
						СтрокаТаблицыТоваров.Добавить(НомерНалога);                 // 11 - Номер налога (1)
						СтрокаТаблицыТоваров.Добавить(СуммаНДС);  					// 12 - Сумма налога (1)
						СтрокаТаблицыТоваров.Добавить(СтавкаНДС);    		        // 13 - Процент налога (1)
						СтрокаТаблицыТоваров.Добавить(0);                           // 14 - Номер налога (2)
						СтрокаТаблицыТоваров.Добавить(0);                           // 15 - Сумма налога (2)
						СтрокаТаблицыТоваров.Добавить(0);                           // 16 - Процент налога (2)
						СтрокаТаблицыТоваров.Добавить("");                          // 17 - Наименование секции форматирования товарной строки
						
						СтрокаТаблицыТоваров.Добавить("0");     				     // 18 - Ставка НДС строкой
						СтрокаТаблицыТоваров.Добавить(Ложь); 					     // 19 - Подакцизный товар
						
						ТаблицаТоваров.Добавить(СтрокаТаблицыТоваров);
					КонецЦикла;
					
					// Подготовка таблицы оплат
					ТаблицаОплат = Новый Массив();
					
					// Наличные
					СтрокаОплаты = Новый СписокЗначений();
					СтрокаОплаты.Добавить(0);
					СтрокаОплаты.Добавить(Объект.СуммаДокумента);
					СтрокаОплаты.Добавить("Наличная оплата");
					СтрокаОплаты.Добавить("");
					ТаблицаОплат.Добавить(СтрокаОплаты);
					// Безналичные
					СтрокаОплаты = Новый СписокЗначений();
					СтрокаОплаты.Добавить(1);
					СтрокаОплаты.Добавить(Объект.СуммаДокумента - Объект.ОплатаПлатежнымиКартами.Итог("Сумма"));
					СтрокаОплаты.Добавить("Безналичная оплата");
					СтрокаОплаты.Добавить("");
					ТаблицаОплат.Добавить(СтрокаОплаты);
					
					// Подготовка таблицы общих параметров
					ОбщиеПараметры = Новый Массив();
					ОбщиеПараметры.Добавить(1);                      //  1 - Тип чека
					ОбщиеПараметры.Добавить(Истина);                 //  2 - Признак фискального чека
					ОбщиеПараметры.Добавить(Неопределено);           //  3 - Печать на подкладном документе
					ОбщиеПараметры.Добавить(Объект.СуммаДокумента);  //  4 - Сумма по чеку без скидок/наценок
					ОбщиеПараметры.Добавить(Объект.СуммаДокумента);  //  5 - Сумма по чеку с учетом всех скидок/наценок
					ОбщиеПараметры.Добавить("");                     //  6 - Номер дисконтной карты
					ОбщиеПараметры.Добавить("");                     //  7 - Текст шапки
					ОбщиеПараметры.Добавить("");                     //  8 - Текст подвала
					ОбщиеПараметры.Добавить(0);                      //  9 - Номер смены (для копии чека)
					ОбщиеПараметры.Добавить(0);                      // 10 - Номер чека (для копии чека)
					ОбщиеПараметры.Добавить(0);                      // 11 - Номер документа (для копии чека)
					ОбщиеПараметры.Добавить(0);                      // 12 - Дата документа (для копии чека)
					ОбщиеПараметры.Добавить("");                     // 13 - Имя кассира (для копии чека)
					ОбщиеПараметры.Добавить("");                     // 14 - Пароль кассира
					ОбщиеПараметры.Добавить(0);                      // 15 - Номер шаблона
					ОбщиеПараметры.Добавить("");                     // 16 - Наименование секции форматирования шапки
					ОбщиеПараметры.Добавить("");                     // 17 - Наименование секции форматирования подвала
					
					ВходныеПараметры.Добавить(ТаблицаТоваров);
					ВходныеПараметры.Добавить(ТаблицаОплат);
					ВходныеПараметры.Добавить(ОбщиеПараметры);
					
					// Печатаем чек.
					Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
																			"PrintReceipt",
																			ВходныеПараметры,
																			ВыходныеПараметры);
					
					Если Результат Тогда
						
						// Установить полученное значение номера чека реквизиту документа.
						Объект.НомерЧекаККМ = ВыходныеПараметры[1];
						Объект.Статус = СтатусЧекПробит;
						Объект.Дата = ТекущаяДата();
						Если НЕ ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
							Объект.НомерЧекаККМ = 1;
						КонецЕсли;
						
						Модифицированность = Истина;
						
						РезультатПроведения = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
						Если РезультатПроведения = Истина Тогда
							УстановитьРежимТолькоПросмотр();
						КонецЕсли;
						
					Иначе
						ТекстСообщения = НСтр("ru='При печати чека произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При друку чека сталася помилка."
"Чек не надрукований на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,
													 "%ДополнительноеОписание%",
													 ВыходныеПараметры[1]);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
					
					// Отключаем ФР
					МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);
					
				Иначе
					ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При підключенні пристрою сталася помилка."
"Чек не надрукований на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru='Не выбран фискальный регистратор';uk='Не встановлено фіскальний реєстратор'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			// Внешнее оборудование не используется
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры // НапечататьЧек()

// Процедура вызывается при нажатии кнопки НапечататьЧек командной панели.
//
&НаКлиенте
Процедура ПробитьЧекВыполнить(Команда)
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если Объект.ПометкаУдаления Тогда
		
		ТекстОшибки = НСтр("ru='Документ помечен на удаление';uk='Документ позначений на видалення'");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Объект.Дата = ТекущаяДата();
	
	Если НЕ Отказ И ПроверитьЗаполнение() Тогда
		
		ПробитьЧек();
		
	КонецЕсли;
	
КонецПроцедуры // ПробитьЧекВыполнить()

// Функция проверяет возможность печати чека на фискальном регистраторе.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма документа
//
// Возвращаемое значение:
//	Булево - Признак возможности печати
//
&НаКлиенте
Функция ПроверитьВозможностьПечатиЧека(Форма)
	
	ПечататьЧек = Истина;
	
	// Если объект не проведен или модифицирован - выполним проведение.
	Если НЕ Форма.Объект.Проведен
		ИЛИ Форма.Модифицированность Тогда
		
		КодОтвета = Вопрос(НСтр("ru='Операция возможна только после проведения документа, провести документ?';uk='Операція можлива тільки після проведення документа, провести документ?'"), РежимДиалогаВопрос.ДаНет);
		Если КодОтвета = КодВозвратаДиалога.Да Тогда
			
			Попытка
				Если НЕ Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
					ПечататьЧек = Ложь;
				КонецЕсли;
			Исключение
				Предупреждение(НСтр("ru='Не удалось выполнить проведение документа';uk='Не вдалося виконати проведення документа'"));
				ПечататьЧек = Ложь;
			КонецПопытки;
			
		Иначе
			ПечататьЧек = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПечататьЧек;

КонецФункции // ПроверитьВозможностьПечатиЧека()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.РасшифровкаПлатежаСписком =  РасшифровкаПлатежаСписком;
	
КонецПроцедуры
